
&НаСервере
Процедура РассчитатьНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Рассчитать();
	ЗначениеВДанныеФормы(ДокументОбъект,Объект);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	       
	Если Объект.Ссылка.Пустая() или Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветЗаписиДокумента", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Перед расчетом документ будет записан. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	РассчитатьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветЗаписиДокумента (Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	РассчитатьНаСервере();
	
КонецПроцедуры