#Наименование номенклатуры=Номенклатура из процесса1

#language: ru
@tree
#report.feature=
#report.story=
Функциональность: Продажа товара. Товара на складе достаточно

@КодНастройкиПроцесса=000000001
@ПолныйКодПроцесса=01
Сценарий: Продажа товара. Товара на складе достаточно

@КодСценария=000000001
* Сценарий: Оформление приходной накладной
	И я подключаю TestClient "Бухгалтер" логин "Бухгалтер" пароль ""
	И я закрыл все окна клиентского приложения
	*И Создание номенклатуры
			#Наименование = Наименование номенклатуры
		И В командном интерфейсе я выбираю 'Оперативный учет' 'Номенклатура'
		Тогда открылось окно 'Номенклатура'
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Номенклатура (создание)'
		И Я запоминаю значение выражения "Номенклатура из процесса1" в переменную "НаименованиеНоменклатуры"
		И в поле 'Наименование' я ввожу текст "Номенклатура из процесса1"
		И из выпадающего списка "Вид номенклатуры" я выбираю точное значение 'Товар'
		И я нажимаю на кнопку 'Записать и закрыть'
		И я жду закрытия окна 'Номенклатура (создание) *' в течение 20 секунд
	*Когда создаем приходную накладную
		И В командном интерфейсе я выбираю 'Оперативный учет' 'Приходная накладная'
		Тогда открылось окно 'Приходная накладная'
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Приходная накладная (создание)'
		И я нажимаю кнопку выбора у поля "Склад"
		*И Выбор склада
				#Параметры склада = | 'Код'       | 'Наименование' |
			Тогда открылось окно 'Склады'
			И в таблице "Список" я перехожу к строке:
				| 'Код'       | 'Наименование' |
				| '000000002' | 'Юг'           |
			И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Приходная накладная (создание) *'
		И в таблице "СписокНоменклатуры" я нажимаю на кнопку с именем 'СписокНоменклатурыДобавить'
		И в таблице "СписокНоменклатуры" я нажимаю кнопку выбора у реквизита "Номенклатура"
		Тогда открылось окно 'Номенклатура'
		И в таблице "Список" я перехожу к строке:
		| 'Наименование'              |
		| "Номенклатура из процесса1" |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Приходная накладная (создание) *'
		И в таблице "СписокНоменклатуры" я завершаю редактирование строки
		И в таблице "СписокНоменклатуры" я активизирую поле "Количество"
		И в таблице "СписокНоменклатуры" я выбираю текущую строку
		И в таблице "СписокНоменклатуры" в поле 'Количество' я ввожу текст '1'
		И в таблице "СписокНоменклатуры" я завершаю редактирование строки
		И в таблице "СписокНоменклатуры" я активизирую поле "Цена"
		И в таблице "СписокНоменклатуры" я выбираю текущую строку
		И в таблице "СписокНоменклатуры" в поле 'Цена' я ввожу текст '100,00'
		И я перехожу к следующему реквизиту
		И в таблице "СписокНоменклатуры" в поле 'Сумма' я ввожу текст '100,00'
		И в таблице "СписокНоменклатуры" я завершаю редактирование строки
	*И проводим
		И я нажимаю на кнопку 'Провести и закрыть'
		И я жду закрытия окна 'Приходная накладная (создание) *' в течение 20 секунд
	*Тогда появились движения в отчете по Остаткам
		И В командном интерфейсе я выбираю 'Оперативный учет' 'Остатки товаров (ОУ)'
		Тогда открылось окно 'Остатки товаров (ОУ)'
		И в табличном документе 'Результат' я перехожу к ячейке "R1C1"
		И из выпадающего списка с именем "КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение" я выбираю точное значение 'Начало завтрашнего дня'
		И я нажимаю кнопку выбора у поля с именем "КомпоновщикНастроекПользовательскиеНастройкиЭлемент1Значение"
		Тогда открылось окно 'Номенклатура'
		И в таблице "Список" я перехожу к строке:
		| 'Наименование'              |
		| "Номенклатура из процесса1" |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Остатки товаров (ОУ)'
		И я нажимаю на кнопку 'Сформировать'
		И в табличном документе 'Результат' я перехожу к ячейке "R6C3"
		И Табличный документ "Результат" равен макету "ОтчетПриходнаяНакладная"


@КодСценария=000000004
* Сценарий: Оформление расходной накладной
	И я подключаю TestClient "Бухгалтер" логин "Бухгалтер" пароль ""
	И я закрыл все окна клиентского приложения
	И В командном интерфейсе я выбираю 'Оперативный учет' 'Расходная накладная'
	Тогда открылось окно 'Расходная накладная'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно 'Расходная накладная (создание)'
	И я нажимаю кнопку выбора у поля "Склад"
	Тогда открылось окно 'Склады'
	И в таблице "Список" я перехожу к строке:
	| 'Код'       | 'Наименование' |
	| '000000001' | 'Юг'           |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Расходная накладная (создание) *'
	И в таблице "СписокНоменклатуры" я нажимаю на кнопку с именем 'СписокНоменклатурыДобавить'
	И в таблице "СписокНоменклатуры" я нажимаю кнопку выбора у реквизита "Номенклатура"
	Тогда открылось окно 'Номенклатура'
	И в таблице "Список" я перехожу к строке:
	| 'Наименование'              |
	| "Номенклатура из процесса1" |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Расходная накладная (создание) *'
	И в таблице "СписокНоменклатуры" я активизирую поле "Количество"
	И в таблице "СписокНоменклатуры" в поле 'Количество' я ввожу текст '1'
	И в таблице "СписокНоменклатуры" я активизирую поле "Цена"
	И в таблице "СписокНоменклатуры" в поле 'Цена' я ввожу текст '100,00'
	И в таблице "СписокНоменклатуры" я завершаю редактирование строки
	И в таблице "СписокНоменклатуры" я активизирую поле "Сумма"
	И в таблице "СписокНоменклатуры" я выбираю текущую строку
	И в таблице "СписокНоменклатуры" в поле 'Сумма' я ввожу текст '100,00'
	И в таблице "СписокНоменклатуры" я завершаю редактирование строки
	И я нажимаю на кнопку 'Провести и закрыть'
	И я жду закрытия окна 'Расходная накладная (создание) *' в течение 20 секунд
