#Наименование номенклатуры=Отрицательный остаток

#language: ru
@tree
#report.feature=
#report.story=
Функциональность: Продажа товара. Остатка недостаточно

@КодНастройкиПроцесса=000000002
@ПолныйКодПроцесса=02
Сценарий: Продажа товара. Остатка недостаточно

@КодСценария=000000002
* Сценарий: Создание номенклатуры
	И я подключаю TestClient "Бухгалтер" логин "Бухгалтер" пароль ""
	И я закрыл все окна клиентского приложения
	И В командном интерфейсе я выбираю 'Оперативный учет' 'Номенклатура'
	Тогда открылось окно 'Номенклатура'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно 'Номенклатура (создание)'
	И Я запоминаю значение выражения "Отрицательный остаток" в переменную "НаименованиеНоменклатуры"
	И в поле 'Наименование' я ввожу текст "Отрицательный остаток"
	И из выпадающего списка "Вид номенклатуры" я выбираю точное значение 'Товар'
	И я нажимаю на кнопку 'Записать и закрыть'
	И я жду закрытия окна 'Номенклатура (создание) *' в течение 20 секунд


@КодСценария=000000004
* Сценарий: Оформление расходной накладной
	И я подключаю TestClient "Бухгалтер" логин "Бухгалтер" пароль ""
	И я закрыл все окна клиентского приложения
	И В командном интерфейсе я выбираю 'Оперативный учет' 'Расходная накладная'
	Тогда открылось окно 'Расходная накладная'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно 'Расходная накладная (создание)'
	И я нажимаю кнопку выбора у поля "Склад"
	Тогда открылось окно 'Склады'
	И в таблице "Список" я перехожу к строке:
	| 'Код'       | 'Наименование' |
	| '000000001' | 'Юг'           |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Расходная накладная (создание) *'
	И в таблице "СписокНоменклатуры" я нажимаю на кнопку с именем 'СписокНоменклатурыДобавить'
	И в таблице "СписокНоменклатуры" я нажимаю кнопку выбора у реквизита "Номенклатура"
	Тогда открылось окно 'Номенклатура'
	И в таблице "Список" я перехожу к строке:
	| 'Наименование'              |
	| "Отрицательный остаток" |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Расходная накладная (создание) *'
	И в таблице "СписокНоменклатуры" я активизирую поле "Количество"
	И в таблице "СписокНоменклатуры" в поле 'Количество' я ввожу текст '1'
	И в таблице "СписокНоменклатуры" я активизирую поле "Цена"
	И в таблице "СписокНоменклатуры" в поле 'Цена' я ввожу текст '100,00'
	И в таблице "СписокНоменклатуры" я завершаю редактирование строки
	И в таблице "СписокНоменклатуры" я активизирую поле "Сумма"
	И в таблице "СписокНоменклатуры" я выбираю текущую строку
	И в таблице "СписокНоменклатуры" в поле 'Сумма' я ввожу текст '100,00'
	И в таблице "СписокНоменклатуры" я завершаю редактирование строки
	И я нажимаю на кнопку 'Провести и закрыть'
	Тогда открылось окно '1С:Предприятие'
	И я нажимаю на кнопку 'OK'
	Когда в логе сообщений TestClient есть строка по шаблону "Превышение остатка по номенклатуре Отрицательный остаток в количестве *"
