#language: ru
@tree

Функционал: Приходная накладная

Как Бухгалтер
Я хочу создавать и проводить приходные накладные
Чтобы отражать закупку от поставщика

Контекст: 
	И я подключаю TestClient "Бухгалтер" логин "Бухгалтер" пароль ""


Сценарий: Создание и проведение Приходной накладной с одним товаром
	Дано создаем номенклатуру
	Когда создаем Приходную накладную
		И В командном интерфейсе я выбираю 'Оперативный учет' 'Приходная накладная'
		Тогда открылось окно 'Приходная накладная'
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Приходная накладная (создание)'
		И я нажимаю кнопку выбора у поля "Склад"
		Тогда открылось окно 'Склады'
		И в таблице "Список" я перехожу к строке:
			| 'Код'       | 'Наименование' |
			| '000000001' | 'Юг'           |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Приходная накладная (создание) *'
		И в таблице "СписокНоменклатуры" я нажимаю на кнопку с именем 'СписокНоменклатурыДобавить'
		И в таблице "СписокНоменклатуры" я нажимаю кнопку выбора у реквизита "Номенклатура"
		Тогда открылось окно 'Номенклатура'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование' |
			| $НаименованиеНоменклатуры$     |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Приходная накладная (создание) *'
		И в таблице "СписокНоменклатуры" я активизирую поле "Количество"
		И в таблице "СписокНоменклатуры" в поле 'Количество' я ввожу текст '1'
		И я перехожу к следующему реквизиту
		И в таблице "СписокНоменклатуры" в поле 'Цена' я ввожу текст '100,00'
		И я перехожу к следующему реквизиту
		И в таблице "СписокНоменклатуры" в поле 'Сумма' я ввожу текст '100,00'
		И в таблице "СписокНоменклатуры" я завершаю редактирование строки
	И проводим
		И я нажимаю на кнопку 'Провести и закрыть'
		И я жду закрытия окна 'Приходная накладная (создание) *' в течение 20 секунд
	Тогда появились движения в Отчете по остаткам
		И затем я выполняю код встроенного языка
			|' Контекст.Вставить("ТестоваяСтруктура", Новый Структура("Количество,Имя", 1, "Тест")); '|
		И В командном интерфейсе я выбираю 'Оперативный учет' 'Остатки товаров (ОУ)'
		Тогда открылось окно 'Остатки товаров (ОУ)'
		И в табличном документе 'Результат' я перехожу к ячейке "R1C1"
		И из выпадающего списка с именем "КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение" я выбираю точное значение 'Начало завтрашнего дня'
		И я нажимаю кнопку выбора у поля с именем "КомпоновщикНастроекПользовательскиеНастройкиЭлемент1Значение"
		Тогда открылось окно 'Номенклатура'
		И в таблице "Список" я перехожу к строке:
			| 'Наименование' |
			| $НаименованиеНоменклатуры$    |
		И в таблице "Список" я выбираю текущую строку
		Тогда открылось окно 'Остатки товаров (ОУ)'
		И я нажимаю на кнопку 'Сформировать'
		Дано Табличный документ "Результат" равен макету "ОтчетПриходнаяНакладная"
	И я записываю в журнал регистрации "Сценарий успешно выполнен"


