#language: ru
@tree
@ExportScenarios

Функционал: Экспортные сценарии

Сценарий: создаем номенклатуру
		И В командном интерфейсе я выбираю 'Оперативный учет' 'Номенклатура'
		Тогда открылось окно 'Номенклатура'
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Номенклатура (создание)'
		И в поле "Наименование" я ввожу текущую дату и текущее время
		И я запоминаю значение поля "Наименование" как "НаименованиеНоменклатуры"
		И из выпадающего списка "Вид номенклатуры" я выбираю точное значение 'Товар'
		И я нажимаю на кнопку 'Записать и закрыть'
		И я жду закрытия окна 'Номенклатура (создание) *' в течение 20 секунд